{
    "example_compte_rendu_input": "compte-rendu de réunion  Dossier de Monsieur et Madame NOEL\nMonsieur et Madame NOEL possèdent un bien à Annecy, grevé d'une servitude d'alignement pour une réserve foncière visant l'élargissement de la voie publique.\nLeur demande de changement de sous-destination de bureaux en habitation a été refusée par la mairie, car les places de stationnement se situent dans cette réserve.\nIls ont donc exercé leur droit de délaissement, obligeant la mairie à acquérir leur bien sous un délai d'un an. Passé ce délai, en l'absence d'accord, ils pourront saisir le juge de l'expropriation.\nLeur stratégie repose sur plusieurs axes : contester la réserve foncière, s'assurer que la mairie respecte ses obligations d'achat, et négocier la vente au prix estimé de 250 000 €.\nIls envisagent également une action en justice devant le Tribunal Administratif pour remettre en cause la réserve foncière si nécessaire. Les prochaines étapes incluent une analyse juridique, une expertise immobilière et des discussions avec la mairie pour trouver une issue favorable.",
    
    "example_missions_intro_input": "Voilà un exemple de présentation des missions à effectuer :\n- Mission 1 : assistance dépot CU : 700 € HT\n- Mission 2 : recours TA GRENOBLE, refus de CU ou CU avec réserve foncière : 2300 euros HT.\n- Mission 3 : assistance négociation avec la Mairie d'Annecy ; honoraire de résultats 5% HT du prix de vente de la parcelle.",
    
    "example_json_output": {
        "liste_missions": "**MISSION 1 - Analyse juridique et dépôt d'une demande de certificat d'urbanisme (CU)**\n1.\tAnalyse approfondie de la situation au regard du PLU et de la réglementation applicable\n2.\tDépôt d'une demande de certificat d'urbanisme auprès de la mairie d'Annecy\n3.\tPrécision des droits attachés au terrain et identification des contraintes opposables\n4.\tPrécision des droits attachés au terrain et identification des contraintes opposables\n\n**MISSION 2 - Recours devant le Tribunal administratif de GRENOBLE**\n1.\tIntroduction d'un recours devant le Tribunal administratif de Grenoble en cas de certificat d'urbanisme défavorable ou de maintien de la réserve foncière\n2.\tContestation de la légalité et du bien-fondé de la servitude au regard des règles d'urbanisme en vigueur\n3.\tRédaction des mémoires (2 jeux)\n4.\tRédaction des actes de procédure\n5.\tSuivi de l'exécution\n\nLa plaidoirie n'est pas incluse dans cette mission et fera l'objet d'un accord séparé le cas échéant.\n\n**MISSION 3 - Négociation avec la Mairie d'Annecy et valorisation du bien**\n1.\tEngagement de discussions avec la Mairie d'Annecy en parallèle de l'action contentieuse\n2.\tNégociation d'une offre d'acquisition amiable de la partie du terrain frappée par la réserve foncière\n3.\tObjectif d'obtenir une indemnisation conforme à la valeur vénale du bien, estimée à 250 000 euros\n4.\tRéalisation d'une expertise immobilière contradictoire pour étayer la position des clients",
        "honoraires": "Pour la mission décrite ci-dessus, nous évaluons nos honoraires forfaitairement en fonction du temps que nous estimons devoir consacrer à l'exécution des missions, hors des frais et dépenses que nous serions amenés à engager pour votre compte ou qui sont prévus par la présente.\n\nLes autres frais, débours et dépens seront réglés sans délai par le client, soit directement au professionnel qui les aura facturés, soit au cabinet qui en aura fait l'avance pour le compte du client.\n\nCes frais, débours et dépens comprennent notamment, sans que cette énumération soit exhaustive : frais d'huissier, de greffe, etc…\n\nLes frais de dossier seront forfaitisés sur la base de 10 % du montant HT des honoraires. Les frais d'envoi de recommandé sont forfaitisés à 18 €HT par envoi.\n\nLes frais de déplacement en voiture, hors ceux conventionnellement prévus, seront facturés sur la base de 0,50 € HT par kilomètre.\n\nNos honoraires pour les missions décrites ci-dessus seront les suivants :\n•\tMISSION 1 : 700 euros HT\n•\tMISSION 2 : 2 300 euros HT\n•\tMISSION 3 – honoraires de résultat: C.F. ci-après\n\nConformément aux usages de la profession, nous procèderons à la facturation de provisions à valoir sur les honoraires au fur et à mesure de l'avancement de la mission.\n\nLe budget proposé ci-dessus se fonde sur une estimation raisonnable du temps que nous consacrerons à la réalisation de cette mission.\n\nToute autre tâche que celles ci-dessus mentionnées au II pourra faire l'objet d'un devis spécifique ou sera facturée en plus sur la base du temps passé selon notre taux horaire 2024, savoir :\n- RDV au Cabinet : 200 € HT\n- RDV extérieur : 300 € HT\n- Rédaction, autres tâches : 150 € HT"
    },
    "system_content": "Tu es un avocat expérimenté. Tu dois renvoyer STRICTEMENT un JSON avec deux champs : 'liste_missions' et 'honoraires'. Ce JSON doit respecter le schéma Pydantic MissionsHonoraires (pas d'autres champs).\n\n1) Dans 'liste_missions', tu rédiges la partie 'Description de nos Missions' à partir des éléments suivants :\n   - un exposé clair, formel et structuré des missions, numérotées (**MISSION 1**, **MISSION 2**, etc.).\n   - Pour chacune, liste de façon synthétique les actions précises, en plusieurs points numérotés (1., 2., 3., ...).\n\n2) Dans 'honoraires', tu renvoies le texte ci-dessous, en ajustant les honoraires selon les missions à effectuer :\n\nPour la mission décrite ci-dessus, nous estimons nos honoraires à la somme de XX € H.T, hors des frais et dépenses que nous serions amenés à engager pour votre compte ou qui sont prévus par la présente.\n\nLes autres frais, débours et dépens seront réglés sans délai par le client, soit directement au professionnel qui les aura facturés, soit au cabinet qui en aura fait l'avance pour le compte du client.\n\nCes frais, débours et dépens comprennent notamment, sans que cette énumération soit exhaustive : frais d'huissier, de greffe, etc…\n\nNos honoraires pour les missions décrites ci-dessus seront les suivants :\n\nAu titre de la Mission 1 (nom de la Mission 1) : XX€ HT\n\nAu titre de la Mission 2 (nom de la Mission 2) : XX€ HT\n\nAu titre de la Mission n (nom de la Mission n) : XX€ HT\n\nLes frais de dossier seront forfaitisés sur la base de 10 % du montant HT des honoraires et seront de : XX euros HT.\n\nLes frais de déplacement en voiture, hors ceux conventionnellement prévus, seront facturés sur la base de 0,50 € HT par kilomètre.\n\nConformément aux usages de la profession, nous procèderons à la facturation de provisions à valoir sur les honoraires au fur et à mesure de l'avancement de la mission.\n\nLe budget proposé ci-dessus se fonde sur une estimation raisonnable du temps que nous consacrerons à la réalisation de cette mission.\n\nToute autre tâche que celles ci-dessus mentionnées au II pourra faire l'objet d'un devis spécifique ou sera facturée en plus sur la base du temps passé selon notre taux horaire 2025, à savoir :\n- RDV au Cabinet : 200 € HT\n- RDV extérieur : 300 € HT\n- Rédaction, autres tâches : 150 € HT\n\nNe renvoie jamais de contenu en dehors de ce JSON. N'inclus pas de guillemets parasites ou de '```'. Juste l'objet JSON.\n\n------------------ \nTu feras tout cela grâce aux éléments suivants :",
    "annecy_example_output": {
        "nom_prenom_client": "Monsieur et Madame NOEL",
        "nom_de_l_affaire": "Réserve foncière Ville d'Annecy – 6 rue des Francs Tireurs",
        "intro_lettre": "Cher Monsieur, Chère Madame,\nPour donner suite à notre rendez-vous du 3 février 2025 dernier à mon cabinet, je vous confirme les termes de notre collaboration concernant votre bien immobilier situé au 6, rue des Francs Tireurs à Annecy, cadastré sous la référence BS 006.",
        "matiere_de_mission": "Droit de l'urbanisme",
        "context_et_obj": "Votre propriété est partiellement grevée d'une servitude d'alignement constituant une réserve foncière au bénéfice de la ville d'Annecy.\n\nCette servitude, impactant votre garage, a motivé un refus à votre demande de déclaration préalable déposée en vue de transformer la destination \"bureaux\" en \"habitation\".\n\nVous avez notifié à la ville d'Annecy une demande d'acquisition, mettant en œuvre votre droit de délaissement.\n\nNotre mission consistera à vous accompagner dans vos démarches juridiques et vos négociations avec la mairie afin de défendre vos intérêts patrimoniaux."
    }
}
  